fish_info = {

"فایتر": """
🐠 فایتر

دما:
26 تا 28 درجه

PH:
6.5 تا 7.5

حجم پیشنهادی:
20 لیتر به بالا

رفتار:
قلمروطلب

سختی نگهداری:
آسان

تغذیه:
همه چیز خوار

طول عمر:
3 تا 5 سال
""",

"گوپی": """
🐟 گوپی

دما:
24 تا 28 درجه

PH:
7 تا 8

حجم پیشنهادی:
40 لیتر به بالا

رفتار:
صلح جو

سختی نگهداری:
آسان

تغذیه:
همه چیز خوار

طول عمر:
2 تا 3 سال
""",

"مولی": """
🐟 مولی

دما:
24 تا 28 درجه

PH:
7 تا 8.5

حجم پیشنهادی:
60 لیتر به بالا

رفتار:
صلح جو

سختی نگهداری:
آسان
""",

"پلاتی": """
🐟 پلاتی

دما:
22 تا 27 درجه

PH:
7 تا 8

حجم پیشنهادی:
50 لیتر به بالا

رفتار:
صلح جو
""",

"سوردتیل": """
🐟 سوردتیل

دما:
22 تا 28 درجه

حجم پیشنهادی:
80 لیتر به بالا

رفتار:
فعال و صلح جو
""",

"زبرا": """
🐟 زبرا

دما:
22 تا 27 درجه

حجم پیشنهادی:
40 لیتر به بالا

رفتار:
گله ای
""",

"نئون تترا": """
🐟 نئون تترا

دما:
22 تا 26 درجه

حجم پیشنهادی:
50 لیتر به بالا

رفتار:
گله ای و صلح جو
""",

"آنجل": """
🐠 آنجل

دما:
26 تا 30 درجه

حجم پیشنهادی:
120 لیتر به بالا

رفتار:
نیمه تهاجمی
""",

"گورامی": """
🐠 گورامی

دما:
24 تا 28 درجه

حجم پیشنهادی:
80 لیتر به بالا

رفتار:
نسبتاً آرام
""",

"کوریدوراس": """
🐟 کوریدوراس

دما:
22 تا 28 درجه

حجم پیشنهادی:
60 لیتر به بالا

رفتار:
کف خوار صلح جو
""",

"دیسکس": """
🐠 دیسکس

دما:
28 تا 31 درجه

حجم پیشنهادی:
250 لیتر به بالا

رفتار:
آرام

سختی نگهداری:
سخت
""",

"اسکار": """
🐡 اسکار

دما:
24 تا 28 درجه

حجم پیشنهادی:
200 لیتر به بالا

رفتار:
تهاجمی
""",

"پرت": """
🐠 پرت

دما:
25 تا 30 درجه

حجم پیشنهادی:
180 لیتر به بالا

رفتار:
نیمه تهاجمی
""",

"سورم": """
🐠 سورم

دما:
24 تا 30 درجه

حجم پیشنهادی:
250 لیتر به بالا

رفتار:
نیمه تهاجمی
""",

"فلاورهورن": """
🐠 فلاورهورن

دما:
26 تا 30 درجه

حجم پیشنهادی:
250 لیتر به بالا

رفتار:
بسیار تهاجمی
""",

"چانا": """
🐠 چانا

دما:
24 تا 30 درجه

رفتار:
شکارچی

نیاز:
درب محکم
""",

"آروانا": """
🐉 آروانا

دما:
24 تا 30 درجه

حجم پیشنهادی:
500 لیتر به بالا

رفتار:
شکارچی

نیاز:
درب کاملاً بسته
""",

"ردتیل": """
🐟 ردتیل

دما:
24 تا 28 درجه

حجم پیشنهادی:
700 لیتر به بالا

رفتار:
شکارچی
""",

"پولیپتروس": """
🐟 پولیپتروس

دما:
24 تا 28 درجه

حجم پیشنهادی:
250 لیتر به بالا

رفتار:
شکارچی آرام
""",

"پنگوسی": """
🐟 پنگوسی

دما:
22 تا 28 درجه

حجم پیشنهادی:
600 لیتر به بالا

رفتار:
فعال
"""
}

diseases = {

"سفیدک": """
⚪ سفیدک

علائم:
نقاط سفید روی بدن

درمان:
افزایش دما و داروی ضد سفیدک

پیشگیری:
قرنطینه ماهی جدید
""",

"سوراخی سر": """
⚪ سوراخی سر

علائم:
حفره روی سر

درمان:
مترونیدازول و بهبود کیفیت آب
""",

"پوسیدگی باله": """
⚪ پوسیدگی باله

علائم:
از بین رفتن باله

درمان:
نمک و داروی ضد باکتری
""",

"قارچ": """
⚪ قارچ

علائم:
پرزهای سفید روی بدن

درمان:
داروی ضد قارچ
""",

"انگل پوستی": """
⚪ انگل پوستی

علائم:
خاراندن بدن به اشیا

درمان:
داروی ضد انگل
""",

"انگل آبششی": """
⚪ انگل آبششی

علائم:
تنفس سریع

درمان:
داروی ضد انگل
""",

"آب آوردگی شکم": """
⚪ آب آوردگی شکم

علائم:
تورم شکم و سیخ شدن فلس ها

درمان:
قرنطینه و درمان دارویی
""",

"ورم شکم": """
⚪ ورم شکم

علائم:
بزرگ شدن غیرطبیعی شکم

درمان:
بهبود تغذیه و دارو
""",

"بیرون زدگی چشم": """
⚪ بیرون زدگی چشم

علائم:
برآمدگی چشم

درمان:
بهبود کیفیت آب
""",

"مسمومیت آمونیاک": """
⚪ مسمومیت آمونیاک

علائم:
بی حالی و تنفس شدید

درمان:
سیفون فوری آب
"""
}

compatibility = {

("اسکار","پرت"): "✅ سازگار",
("اسکار","سورم"): "✅ سازگار",
("اسکار","آنجل"): "❌ ناسازگار",

("آنجل","گورامی"): "✅ نسبتاً سازگار",
("آنجل","نئون تترا"): "⚠️ با ریسک شکار",

("فایتر","گوپی"): "❌ ناسازگار",
("فایتر","مولی"): "⚠️ با احتیاط",

("چانا","گوپی"): "❌ غذای زنده 😅",
("چانا","مولی"): "❌ غذای زنده 😅",

("آروانا","پرت"): "⚠️ با احتیاط",
("آروانا","ردتیل"): "⚠️ فقط در تانک بسیار بزرگ",

("پرت","سورم"): "✅ سازگار",
("پرت","فلاورهورن"): "❌ ناسازگار",

("دیسکس","کوریدوراس"): "✅ سازگار",
("دیسکس","آنجل"): "✅ نسبتاً سازگار",

("پولیپتروس","اسکار"): "✅ نسبتاً سازگار",
("پنگوسی","اسکار"): "⚠️ نیازمند فضای زیاد"
}
