fish_info = {

    "فایتر": """
🐠 فایتر

دما: 26 تا 28

PH: 6.5 تا 7.5

حجم پیشنهادی:
20 لیتر به بالا

رفتار:
قلمروطلب
""",

    "اسکار": """
🐠 اسکار

دما: 24 تا 28

حجم پیشنهادی:
200 لیتر به بالا

رفتار:
نیمه تهاجمی
""",

    "چانا": """
🐠 چانا

دما: 24 تا 30

رفتار:
شکارچی

نیاز:
درب محکم
""",

    "آروانا": """
🐠 آروانا

دما: 24 تا 30

حجم پیشنهادی:
500 لیتر به بالا

نیاز:
درب کاملاً بسته
"""
}

diseases = {

    "سفیدک": """
⚪ سفیدک

علائم:
نقاط سفید روی بدن

درمان:
افزایش دما و داروی ضد سفیدک
""",

    "سوراخی سر": """
⚪ سوراخی سر

علائم:
حفره روی سر

درمان:
مترونیدازول و بهبود کیفیت آب
""",

    "پوسیدگی باله": """
⚪ پوسیدگی باله

علائم:
از بین رفتن لبه باله

درمان:
نمک و داروی ضد باکتری
"""
}
compatibility = {

    ("اسکار", "پرت"): "✅ سازگار",

    ("اسکار", "آنجل"): "❌ ناسازگار",

    ("فایتر", "گوپی"): "❌ ناسازگار",

    ("آنجل", "گورامی"): "✅ نسبتاً سازگار",

    ("چانا", "گوپی"): "❌ غذای زنده 😅"
}